src/cf/Reports/ОтчетВыполненияРабот_Старая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ОтчетВыполненияРабот_Старая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/Enums/Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоОжидаетПриемки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/ОтчетВыполненияРабот_Старая/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьОтчет(Команда)
	ВыполнитьОтчетНаСервере(тд);
	//тд.Показать();
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОтчетНаСервере(тд)
	
	//тд = новый ТабличныйДокумент;
	
	тд.Очистить();

	
	макет = РеквизитФормыВЗначение("Отчет").получитьМакет("Макет");
	облЗаголовок = макет.ПолучитьОбласть("Заголовок");
	облСтрока = макет.ПолучитьОбласть("Строка");
	облПодвал = макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
                   |    Задание.Ссылка КАК Задание,
                   |    Задание.ТекстЗадания,
                   |    Задание.Дата,
                   |    Задание.НачалоПлан,
                   |    Задание.ОкончаниеПлан,
                   |    Задание.ВремяПлан,
                   |    Задание.НачалоФакт,
                   |    Задание.ОкончаниеФакт,
                   |    Задание.ВремяФакт,
                   |    Задание.ДатаПриемки,
                   |    ВЫБОР
                   |        КОГДА Задание.ВремяПлан < Задание.ВремяФакт
                   |            ТОГДА Задание.ВремяПлан
                   |        ИНАЧЕ Задание.ВремяФакт
                   |    КОНЕЦ КАК МинимальноеВремя,
                   |    Задание.СписокИсполнителей.(
                   |        Исполнитель
                   |    ),
                   |    Задание.ТрудозатратыИсполнителей.(
                   |        Комментарий
                   |    )
                   |ИЗ
                   |    Документ.Задание КАК Задание
                   |ГДЕ
                   |    Задание.Статус = &СтатусПринято
                   |    И Задание.ДатаПриемки МЕЖДУ &НачалоПериода И &КонецПериода
                   |    И Задание.Проект В ИЕРАРХИИ(&Проект)";
	
	Запрос.УстановитьПараметр("СтатусПринято",перечисления.Статус.Принято);				
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));				
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Проект",Отчет.Проект);				
	
	выборка = Запрос.Выполнить().Выбрать();
	тд.вывести(облЗаголовок);
	
	ВремяПлан = 0;
	ВремяФакт = 0;
	МинимальноеВремя = 0;
	пока выборка.Следующий() цикл
		 облСтрока.Параметры.Заполнить(выборка);
         
         тчКомментарии = выборка.ТрудозатратыИсполнителей.выбрать();
         Комментарии = " (";
         ПервыйРаз = Истина;
         Пока тчКомментарии.следующий() Цикл
             Если ЗначениеЗаполнено(тчКомментарии.Комментарий) Тогда
                 Комментарии = Комментарии + ?(ПервыйРаз,"",", ")+СокрЛП(тчКомментарии.Комментарий);
                 ПервыйРаз = Ложь;
             КонецЕсли; 
         КонецЦикла;
         Если НЕ ПервыйРаз Тогда
             облСтрока.Параметры.ТекстЗадания = облСтрока.Параметры.ТекстЗадания + Комментарии + ")";
         КонецЕсли; 
         
		 тч = выборка.СписокИсполнителей.выбрать();
		 Исполнители = "";
		 пока тч.следующий() цикл
			  Исполнители = Исполнители+?(Исполнители = "","",символы.ПС)+тч.Исполнитель;
		 КонецЦикла;
		 облСтрока.Параметры.Исполнители = Исполнители;
		 тд.вывести(облСтрока);
		 ВремяПлан = ВремяПлан + выборка.ВремяПлан;
		 ВремяФакт = ВремяФакт + выборка.ВремяФакт;
		 МинимальноеВремя = МинимальноеВремя + выборка.МинимальноеВремя;
	 КонецЦикла;
	 
	облПодвал.параметры.ВремяПлан = ВремяПлан; 
	облПодвал.параметры.ВремяФакт = ВремяФакт; 
	облПодвал.параметры.МинимальноеВремя = МинимальноеВремя; 
	тд.вывести(облПодвал);
	
	тд.толькоПросмотр = Истина;	
	тд.ОтображатьЗаголовки=Ложь;
	тд.ОтображатьСетку=Ложь;
	
КонецПроцедуры
